{
  "backend/main.mo": "Main actor implementing user profiles, public/private messaging, and access control with blob storage and authorization mixins. Includes message management with timestamp-based sorting and role-based permissions.",
  "backend/migration.mo": "Migration module that transforms old UserProfile schema (with 'name' field) to new schema (with 'displayName' field) while preserving profile pictures.",
  "feature_evidence.json": "Feature evidence report documenting two features: removing profile picture upload from LoginPage.tsx and updating profile mutation hook to send null/empty profilePicture values.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, contexts, and configuration files for the messaging application.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark mode color tokens for the application theme.",
  "frontend/index.html": "HTML entry point with title 'Alatele' and root div for React application mounting.",
  "frontend/src/App.tsx": "Root application component managing Internet Identity authentication, profile setup flow, view navigation (group chat, private messages, conversations), and QueryClient/LanguageProvider setup.",
  "frontend/src/components/AdminPanel.tsx": "Empty file placeholder for admin panel component.",
  "frontend/src/components/AudioRecorder.tsx": "Empty file placeholder for audio recorder component.",
  "frontend/src/components/ChatNavigation.tsx": "Navigation header component with app logo, user avatar, language toggle, logout button, and tabs for switching between group chat and private messages views.",
  "frontend/src/components/ContactManager.tsx": "Empty file placeholder for contact manager component.",
  "frontend/src/components/ConversationList.tsx": "Displays a list of private message conversations with avatars, last message previews, timestamps, and unread counts. Includes a UserSearch component and handles conversation selection.",
  "frontend/src/components/DualLoginPage.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Application header component showing the Alatele logo, user profile avatar, language toggle, and logout button. Displays the logged-in user's name.",
  "frontend/src/components/LanguageToggle.tsx": "Dropdown menu component for switching between English and Persian (Farsi) languages using a globe icon button.",
  "frontend/src/components/LoginPage.tsx": "Handles Internet Identity login and displays a profile setup form for new users to enter their display name. Shows language toggle and manages authentication state.",
  "frontend/src/components/MessageInput.tsx": "Textarea input component for composing messages with a send button. Supports Enter key to send and Shift+Enter for new lines.",
  "frontend/src/components/MessageList.tsx": "Renders a list of messages with sender avatars, names, timestamps, and message content. Fetches sender profiles and distinguishes between own and other users' messages.",
  "frontend/src/components/MessagingInterface.tsx": "Main messaging interface combining MessageList and MessageInput components. Handles message loading, sending, and auto-scrolling to new messages.",
  "frontend/src/components/PrivateConversation.tsx": "Full-screen private conversation view with header showing contact info, back button, and logout. Integrates MessageList and MessageInput for one-on-one messaging.",
  "frontend/src/components/ProfilePictureUpload.tsx": "React component for uploading and managing profile pictures with preview, validation (type/size), upload progress tracking, and remove functionality using ExternalBlob.",
  "frontend/src/components/UsernameEntry.tsx": "Empty file with no content.",
  "frontend/src/components/UserSearch.tsx": "React component that provides a searchable list of all users with avatars, filtering by name, and user selection callback functionality.",
  "frontend/src/contexts/LanguageContext.tsx": "React context providing internationalization support for English and Farsi languages with nested translation objects for app UI strings. (Content truncated)",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance with authentication, initializes access control with admin token, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useAdminPassword.ts": "Empty file with no content.",
  "frontend/src/hooks/useAuth.ts": "Empty file with no content.",
  "frontend/src/hooks/useContacts.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout, identity state, and AuthClient lifecycle with configurable options. (Content truncated)",
  "frontend/src/hooks/useMessages.ts": "React hook for fetching public messages with polling and sending messages with optimistic updates using React Query mutations.",
  "frontend/src/hooks/usePrivateMessages.ts": "React hooks for managing private messages between users and fetching conversations list with last message and contact profile information. (Content truncated)",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profile management and fetching all users from messages, including queries for caller profile, user profiles by principal, and mutations for saving profiles.",
  "frontend/src/i18n/config.ts": "Empty i18n configuration file (no content).",
  "frontend/src/i18n/locales/en-US.json": "English translations for the Alatele chat app covering login, profile setup, chat interface, search, and language selection.",
  "frontend/src/i18n/locales/fa-IR.json": "Farsi (Persian) translations for the Alatele chat app with RTL support, mirroring the English locale structure.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space and RTL support utilities.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind CSS classes using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, container settings, animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata tracking features, requirements, and architectural notes for Alatele chat app with display-name-only login, public/private messaging, and 50MB file upload support."
}