{
  "backend/main.mo": "Main actor implementing messaging system with username-only authentication, admin/guest roles, user profiles with display names, public/private messages with media attachments, contact management, and access control using mixins for storage and authorization.",
  "backend/migration.mo": "Migration module defining old and new actor state types and a run function that migrates data while initializing new usernames map and adminPrincipal fields.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: username-only authentication, guest login restrictions excluding 'Alaie', admin-only 'Alaie' username restriction, and conditional display name field for admin login.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, hooks, and configuration files describing authentication flow, messaging interfaces, admin panel, language support, and styling system.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark modes with teal/cyan palette and RTL text support.",
  "frontend/index.html": "HTML entry point with page title 'Alatele' and root div for React application mounting.",
  "frontend/src/App.tsx": "Main application component managing authentication state, view routing between login, group chat, private messages, conversations, and admin panel, with language provider wrapper.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component with role-based access control, navigation to contact manager and password change settings, featuring password validation and success/error feedback.",
  "frontend/src/components/AudioRecorder.tsx": "Audio recording component with start/stop/pause controls, playback preview, and sends recorded audio as Uint8Array. Handles microphone permissions and displays recording time.",
  "frontend/src/components/ChatNavigation.tsx": "Navigation header for chat views with tabs for group chat and private messages, displays user profile info, and includes admin panel access and logout buttons.",
  "frontend/src/components/ContactManager.tsx": "Contact management interface for admins to view existing contacts and add new ones from available users. Displays user avatars and principal IDs.",
  "frontend/src/components/ConversationList.tsx": "Lists all private message conversations with contact names, last message preview, and timestamps. Includes contact manager access for admins.",
  "frontend/src/components/DualLoginPage.tsx": "Login page with separate admin and guest authentication flows. Admin login requires 'Alaie' username; guest login validates against backend and checks for reserved usernames.",
  "frontend/src/components/Header.tsx": "Application header displaying logo, user profile info, language toggle, and logout button. Shows admin panel link for admin users.",
  "frontend/src/components/LanguageToggle.tsx": "Dropdown menu component for switching between English and Farsi languages using the language context.",
  "frontend/src/components/MessageInput.tsx": "A message input component with support for text, images, videos, audio recording, and file attachments. Handles file uploads with progress tracking and enforces single media attachment at a time.",
  "frontend/src/components/MessageList.tsx": "Displays a list of messages with user avatars, timestamps, and inline editing/deletion capabilities. Fetches and displays user profiles for message senders, with admin badge support and localized date formatting.",
  "frontend/src/components/MessagingInterface.tsx": "Main messaging interface that combines MessageList and MessageInput components. Manages message loading, sending, and auto-scrolling to new messages.",
  "frontend/src/components/PrivateConversation.tsx": "Private one-on-one conversation view with header showing contact info, back navigation, and admin panel access. Integrates MessageList and MessageInput for private messaging.",
  "frontend/src/components/UsernameEntry.tsx": "Guest username entry form that validates usernames against reserved names and checks availability via backend. Handles guest authentication before allowing chat access.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides language context with English and Persian (Farsi) translations for the entire app. Includes comprehensive translation keys for all UI elements, messages, and error states.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Handles anonymous and authenticated actors, initializes admin access control, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useAdminPassword.ts": "Provides a React Query mutation hook for changing admin passwords with validation for password length and matching confirmation, though backend implementation is not yet complete.",
  "frontend/src/hooks/useAuth.ts": "Manages authentication state and provides login/logout functions for both admin and guest users, storing credentials in sessionStorage and communicating with the backend actor.",
  "frontend/src/hooks/useContacts.ts": "Provides hooks for managing contacts (fetching, adding), retrieving all users from message history, and fetching individual user profiles using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider for ICP, managing login flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useMessages.ts": "Manages public messages with React Query, providing fetching with 2-second polling and sending with optimistic updates for text and media content.",
  "frontend/src/hooks/usePrivateMessages.ts": "Handles private messaging between contacts and conversation lists, with optimistic updates, media support, and 2-second polling for new messages.",
  "frontend/src/i18n/config.ts": "Empty configuration file for internationalization setup.",
  "frontend/src/i18n/locales/en-US.json": "English (US) translation strings for the entire application including login, messaging, admin panel, contacts, and chat interface labels.",
  "frontend/src/i18n/locales/fa-IR.json": "Persian (Farsi) translation file containing all UI text for the Alatele chat application, including login, messages, admin panel, contacts, and chat interface strings.",
  "frontend/src/index.css": "Global CSS file with Tailwind directives, CSS custom properties for light/dark theme colors using OKLCH color space, and RTL (right-to-left) layout support.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind CSS classes using clsx and tailwind-merge libraries.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider and InternetIdentityProvider wrapper around the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme with OKLCH colors, container settings, typography, animations, and plugin integrations for the design system.",
  "project_state.json": "Project state tracking file documenting the chat application's architecture with username-only authentication, admin role for 'Alaie' username, display name feature, and pending feature requests."
}