{
  "backend/main.mo": "Main actor implementing a messaging system with role-based access control (admin/guest), supporting text, image, video, and audio messages. Includes CRUD operations for messages, admin authentication with hardcoded credentials, and blob storage integration via MixinStorage.",
  "backend/migration.mo": "Migration module that transforms old message records (without audio field) to new message records (with audio field), preserving all other fields and maintaining the messagesStore and nextMessageId state.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including dual-section login, role-based permissions, audio recording/playback, and admin-only edit/delete functionality with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend source files, describing components for authentication, messaging interface, audio recording, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining custom CSS variables for light and dark themes, using a neutral grayscale palette without blue or purple tones.",
  "frontend/index.html": "HTML entry point for the React application with the title 'Alatele' and a root div for mounting the app.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, conditionally rendering DualLoginPage, UsernameEntry for guest username selection, or MessagingInterface based on authentication state.",
  "frontend/src/components/AudioRecorder.tsx": "Audio recording component using MediaRecorder API with record/stop controls, playback preview, timer display, and conversion of recorded audio to Uint8Array format for backend submission.",
  "frontend/src/components/DualLoginPage.tsx": "Login page with two distinct sections: Admin Login (username, password, optional display name with backend validation) and Guest Login (button to navigate to username entry).",
  "frontend/src/components/Header.tsx": "Header component displaying the app logo, title 'Alatele', logged-in user's display name, and a logout button.",
  "frontend/src/components/MessageInput.tsx": "Message input component with textarea, send button, and support for attaching images, videos, and audio recordings with upload progress tracking. Handles file conversion to ExternalBlob format before sending.",
  "frontend/src/components/MessageList.tsx": "Displays a list of messages with avatars, timestamps, and media attachments (images, videos, audio). Supports editing and deleting messages with admin/owner permissions.",
  "frontend/src/components/MessagingInterface.tsx": "Main messaging interface that combines Header, MessageList, and MessageInput components with auto-scrolling behavior and message loading state.",
  "frontend/src/components/UsernameEntry.tsx": "Login screen component with a card displaying the app logo and an input form for users to enter their username to join the chat.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Authentication hook managing user login state (admin/guest roles), storing credentials in sessionStorage, and providing login/logout functions with admin password validation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient creation, login flow, identity persistence, and authentication status states.",
  "frontend/src/hooks/useMessages.ts": "React Query hooks for message operations including fetching all messages (with filtering of subscription prompts), sending messages with optimistic updates, deleting messages, and editing messages. All operations require actor initialization and role-based permissions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like background, foreground, primary, secondary, destructive, borders, and charts using OKLCH color space.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge to merge Tailwind CSS class names conditionally and resolve conflicts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component with necessary context providers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, container settings, font families, border radius variables, shadows, and animations for accordion components with typography and container query plugins.",
  "project_state.json": "Project metadata describing a messenger app with dual login (admin with credentials Negin/Negin-Kish and guest with username only), role-based permissions for message operations, multimedia message support, and tracking of implemented features and pending requests."
}